#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

[command]/home/runner/work/_temp/c5ee0604-0926-4cf1-bff2-630f211baaaa/terraform-bin show -no-color plan.tmp

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # aws_s3_object.redirects["/mongodb"] will be updated in-place
  ~ resource "aws_s3_object" "redirects" {
        id                     = "/mongodb"
        tags                   = {}
      ~ version_id             = "null" -> (known after apply)
      ~ website_redirect       = "/start/tutorials/mongodb/home.html" -> "/start/tutorials/mongodb-pro/home.html"
        # (10 unchanged attributes hidden)
    }

  # aws_s3_object.redirects["/start/install/tutorials/mongo-db-atlas-config.html"] will be updated in-place
  ~ resource "aws_s3_object" "redirects" {
        id                     = "/start/install/tutorials/mongo-db-atlas-config.html"
        tags                   = {}
      ~ version_id             = "null" -> (known after apply)
      ~ website_redirect       = "/start/tutorials/mongodb/mongodb-atlas-config.html" -> "/start/tutorials/mongodb-pro/mongodb-atlas.html"
        # (10 unchanged attributes hidden)
    }

  # aws_s3_object.redirects["/start/tutorials/mongodb-db-atlas-config.html"] will be updated in-place
  ~ resource "aws_s3_object" "redirects" {
        id                     = "/start/tutorials/mongodb-db-atlas-config.html"
        tags                   = {}
      ~ version_id             = "null" -> (known after apply)
      ~ website_redirect       = "/start/tutorials/mongodb/mongodb-atlas-config.html" -> "/start/tutorials/mongodb-pro/mongodb-atlas.html"
        # (10 unchanged attributes hidden)
    }

  # aws_s3_object.redirects["/start/tutorials/mongodb-pro-amazon-documentdb.html"] will be updated in-place
  ~ resource "aws_s3_object" "redirects" {
        id                     = "/start/tutorials/mongodb-pro-amazon-documentdb.html"
        tags                   = {}
      ~ version_id             = "null" -> (known after apply)
      ~ website_redirect       = "/start/tutorials/mongodb/mongodb-pro-amazon-documentdb.html" -> "/start/tutorials/mongodb-pro/amazon-documentdb.html"
        # (10 unchanged attributes hidden)
    }

  # aws_s3_object.redirects["/start/tutorials/mongodb-pro-aws-doc-config.html"] will be updated in-place
  ~ resource "aws_s3_object" "redirects" {
        id                     = "/start/tutorials/mongodb-pro-aws-doc-config.html"
        tags                   = {}
      ~ version_id             = "null" -> (known after apply)
      ~ website_redirect       = "/start/tutorials/mongodb/mongodb-pro-aws-doc-config.html" -> "/start/tutorials/mongodb-pro/amazon-documentdb-tls-ssl.html"
        # (10 unchanged attributes hidden)
    }

  # aws_s3_object.redirects["/start/tutorials/mongodb-pro-user-roles.html"] will be updated in-place
  ~ resource "aws_s3_object" "redirects" {
        id                     = "/start/tutorials/mongodb-pro-user-roles.html"
        tags                   = {}
      ~ version_id             = "null" -> (known after apply)
      ~ website_redirect       = "/start/tutorials/mongodb/mongodb-pro-user-roles.html" -> "/start/tutorials/mongodb-pro/config-user-roles-mongodb-pro.html"
        # (10 unchanged attributes hidden)
    }

  # aws_s3_object.redirects["/start/tutorials/mongodb-pro.html"] will be updated in-place
  ~ resource "aws_s3_object" "redirects" {
        id                     = "/start/tutorials/mongodb-pro.html"
        tags                   = {}
      ~ version_id             = "null" -> (known after apply)
      ~ website_redirect       = "/start/tutorials/mongodb/mongodb-pro-community-enterprise-server.html" -> "/start/tutorials/mongodb-pro/home.html"
        # (10 unchanged attributes hidden)
    }

  # aws_s3_object.redirects["/start/tutorials/mongodb/home.html"] will be created
  + resource "aws_s3_object" "redirects" {
      + acl                    = (known after apply)
      + bucket                 = "stage-docsstageliquibasecom-origin"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "text/html"
      + etag                   = (known after apply)
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "/start/tutorials/mongodb/home.html"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
      + website_redirect       = "/start/tutorials/mongodb-pro/home.html"
    }

  # aws_s3_object.redirects["/start/tutorials/mongodb/mongodb-atlas-config.html"] will be created
  + resource "aws_s3_object" "redirects" {
      + acl                    = (known after apply)
      + bucket                 = "stage-docsstageliquibasecom-origin"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "text/html"
      + etag                   = (known after apply)
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "/start/tutorials/mongodb/mongodb-atlas-config.html"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
      + website_redirect       = "/start/tutorials/mongodb-pro/mongodb-atlas.html"
    }

  # aws_s3_object.redirects["/start/tutorials/mongodb/mongodb-pro-amazon-documentdb.htm"] will be created
  + resource "aws_s3_object" "redirects" {
      + acl                    = (known after apply)
      + bucket                 = "stage-docsstageliquibasecom-origin"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "text/html"
      + etag                   = (known after apply)
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "/start/tutorials/mongodb/mongodb-pro-amazon-documentdb.htm"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
      + website_redirect       = "/start/tutorials/mongodb-pro/amazon-documentdb.html"
    }

  # aws_s3_object.redirects["/start/tutorials/mongodb/mongodb-pro-aws-doc-config.html"] will be created
  + resource "aws_s3_object" "redirects" {
      + acl                    = (known after apply)
      + bucket                 = "stage-docsstageliquibasecom-origin"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "text/html"
      + etag                   = (known after apply)
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "/start/tutorials/mongodb/mongodb-pro-aws-doc-config.html"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
      + website_redirect       = "/start/tutorials/mongodb-pro/amazon-documentdb-tls-ssl.html"
    }

  # aws_s3_object.redirects["/start/tutorials/mongodb/mongodb-pro-user-roles.html"] will be created
  + resource "aws_s3_object" "redirects" {
      + acl                    = (known after apply)
      + bucket                 = "stage-docsstageliquibasecom-origin"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "text/html"
      + etag                   = (known after apply)
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "/start/tutorials/mongodb/mongodb-pro-user-roles.html"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
      + website_redirect       = "/start/tutorials/mongodb-pro/config-user-roles-mongodb-pro.html"
    }

Plan: 5 to add, 7 to change, 0 to destroy.
::debug::Terraform exited with code 0.
::debug::stdout: %0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  + create%0A  ~ update in-place%0A%0ATerraform will perform the following actions:%0A%0A  # aws_s3_object.redirects["/mongodb"] will be updated in-place%0A  ~ resource "aws_s3_object" "redirects" {%0A        id                     = "/mongodb"%0A        tags                   = {}%0A      ~ version_id             = "null" -> (known after apply)%0A      ~ website_redirect       = "/start/tutorials/mongodb/home.html" -> "/start/tutorials/mongodb-pro/home.html"%0A        # (10 unchanged attributes hidden)%0A    }%0A%0A  # aws_s3_object.redirects["/start/install/tutorials/mongo-db-atlas-config.html"] will be updated in-place%0A  ~ resource "aws_s3_object" "redirects" {%0A        id                     = "/start/install/tutorials/mongo-db-atlas-config.html"%0A        tags                   = {}%0A      ~ version_id             = "null" -> (known after apply)%0A      ~ website_redirect       = "/start/tutorials/mongodb/mongodb-atlas-config.html" -> "/start/tutorials/mongodb-pro/mongodb-atlas.html"%0A        # (10 unchanged attributes hidden)%0A    }%0A%0A  # aws_s3_object.redirects["/start/tutorials/mongodb-db-atlas-config.html"] will be updated in-place%0A  ~ resource "aws_s3_object" "redirects" {%0A        id                     = "/start/tutorials/mongodb-db-atlas-config.html"%0A        tags                   = {}%0A      ~ version_id             = "null" -> (known after apply)%0A      ~ website_redirect       = "/start/tutorials/mongodb/mongodb-atlas-config.html" -> "/start/tutorials/mongodb-pro/mongodb-atlas.html"%0A        # (10 unchanged attributes hidden)%0A    }%0A%0A  # aws_s3_object.redirects["/start/tutorials/mongodb-pro-amazon-documentdb.html"] will be updated in-place%0A  ~ resource "aws_s3_object" "redirects" {%0A        id                     = "/start/tutorials/mongodb-pro-amazon-documentdb.html"%0A        tags                   = {}%0A      ~ version_id             = "null" -> (known after apply)%0A      ~ website_redirect       = "/start/tutorials/mongodb/mongodb-pro-amazon-documentdb.html" -> "/start/tutorials/mongodb-pro/amazon-documentdb.html"%0A        # (10 unchanged attributes hidden)%0A    }%0A%0A  # aws_s3_object.redirects["/start/tutorials/mongodb-pro-aws-doc-config.html"] will be updated in-place%0A  ~ resource "aws_s3_object" "redirects" {%0A        id                     = "/start/tutorials/mongodb-pro-aws-doc-config.html"%0A        tags                   = {}%0A      ~ version_id             = "null" -> (known after apply)%0A      ~ website_redirect       = "/start/tutorials/mongodb/mongodb-pro-aws-doc-config.html" -> "/start/tutorials/mongodb-pro/amazon-documentdb-tls-ssl.html"%0A        # (10 unchanged attributes hidden)%0A    }%0A%0A  # aws_s3_object.redirects["/start/tutorials/mongodb-pro-user-roles.html"] will be updated in-place%0A  ~ resource "aws_s3_object" "redirects" {%0A        id                     = "/start/tutorials/mongodb-pro-user-roles.html"%0A        tags                   = {}%0A      ~ version_id             = "null" -> (known after apply)%0A      ~ website_redirect       = "/start/tutorials/mongodb/mongodb-pro-user-roles.html" -> "/start/tutorials/mongodb-pro/config-user-roles-mongodb-pro.html"%0A        # (10 unchanged attributes hidden)%0A    }%0A%0A  # aws_s3_object.redirects["/start/tutorials/mongodb-pro.html"] will be updated in-place%0A  ~ resource "aws_s3_object" "redirects" {%0A        id                     = "/start/tutorials/mongodb-pro.html"%0A        tags                   = {}%0A      ~ version_id             = "null" -> (known after apply)%0A      ~ website_redirect       = "/start/tutorials/mongodb/mongodb-pro-community-enterprise-server.html" -> "/start/tutorials/mongodb-pro/home.html"%0A        # (10 unchanged attributes hidden)%0A    }%0A%0A  # aws_s3_object.redirects["/start/tutorials/mongodb/home.html"] will be created%0A  + resource "aws_s3_object" "redirects" {%0A      + acl                    = (known after apply)%0A      + bucket                 = "stage-docsstageliquibasecom-origin"%0A      + bucket_key_enabled     = (known after apply)%0A      + checksum_crc32         = (known after apply)%0A      + checksum_crc32c        = (known after apply)%0A      + checksum_sha1          = (known after apply)%0A      + checksum_sha256        = (known after apply)%0A      + content_type           = "text/html"%0A      + etag                   = (known after apply)%0A      + force_destroy          = false%0A      + id                     = (known after apply)%0A      + key                    = "/start/tutorials/mongodb/home.html"%0A      + kms_key_id             = (known after apply)%0A      + server_side_encryption = (known after apply)%0A      + storage_class          = (known after apply)%0A      + tags_all               = (known after apply)%0A      + version_id             = (known after apply)%0A      + website_redirect       = "/start/tutorials/mongodb-pro/home.html"%0A    }%0A%0A  # aws_s3_object.redirects["/start/tutorials/mongodb/mongodb-atlas-config.html"] will be created%0A  + resource "aws_s3_object" "redirects" {%0A      + acl                    = (known after apply)%0A      + bucket                 = "stage-docsstageliquibasecom-origin"%0A      + bucket_key_enabled     = (known after apply)%0A      + checksum_crc32         = (known after apply)%0A      + checksum_crc32c        = (known after apply)%0A      + checksum_sha1          = (known after apply)%0A      + checksum_sha256        = (known after apply)%0A      + content_type           = "text/html"%0A      + etag                   = (known after apply)%0A      + force_destroy          = false%0A      + id                     = (known after apply)%0A      + key                    = "/start/tutorials/mongodb/mongodb-atlas-config.html"%0A      + kms_key_id             = (known after apply)%0A      + server_side_encryption = (known after apply)%0A      + storage_class          = (known after apply)%0A      + tags_all               = (known after apply)%0A      + version_id             = (known after apply)%0A      + website_redirect       = "/start/tutorials/mongodb-pro/mongodb-atlas.html"%0A    }%0A%0A  # aws_s3_object.redirects["/start/tutorials/mongodb/mongodb-pro-amazon-documentdb.htm"] will be created%0A  + resource "aws_s3_object" "redirects" {%0A      + acl                    = (known after apply)%0A      + bucket                 = "stage-docsstageliquibasecom-origin"%0A      + bucket_key_enabled     = (known after apply)%0A      + checksum_crc32         = (known after apply)%0A      + checksum_crc32c        = (known after apply)%0A      + checksum_sha1          = (known after apply)%0A      + checksum_sha256        = (known after apply)%0A      + content_type           = "text/html"%0A      + etag                   = (known after apply)%0A      + force_destroy          = false%0A      + id                     = (known after apply)%0A      + key                    = "/start/tutorials/mongodb/mongodb-pro-amazon-documentdb.htm"%0A      + kms_key_id             = (known after apply)%0A      + server_side_encryption = (known after apply)%0A      + storage_class          = (known after apply)%0A      + tags_all               = (known after apply)%0A      + version_id             = (known after apply)%0A      + website_redirect       = "/start/tutorials/mongodb-pro/amazon-documentdb.html"%0A    }%0A%0A  # aws_s3_object.redirects["/start/tutorials/mongodb/mongodb-pro-aws-doc-config.html"] will be created%0A  + resource "aws_s3_object" "redirects" {%0A      + acl                    = (known after apply)%0A      + bucket                 = "stage-docsstageliquibasecom-origin"%0A      + bucket_key_enabled     = (known after apply)%0A      + checksum_crc32         = (known after apply)%0A      + checksum_crc32c        = (known after apply)%0A      + checksum_sha1          = (known after apply)%0A      + checksum_sha256        = (known after apply)%0A      + content_type           = "text/html"%0A      + etag                   = (known after apply)%0A      + force_destroy          = false%0A      + id                     = (known after apply)%0A      + key                    = "/start/tutorials/mongodb/mongodb-pro-aws-doc-config.html"%0A      + kms_key_id             = (known after apply)%0A      + server_side_encryption = (known after apply)%0A      + storage_class          = (known after apply)%0A      + tags_all               = (known after apply)%0A      + version_id             = (known after apply)%0A      + website_redirect       = "/start/tutorials/mongodb-pro/amazon-documentdb-tls-ssl.html"%0A    }%0A%0A  # aws_s3_object.redirects["/start/tutorials/mongodb/mongodb-pro-user-roles.html"] will be created%0A  + resource "aws_s3_object" "redirects" {%0A      + acl                    = (known after apply)%0A      + bucket                 = "stage-docsstageliquibasecom-origin"%0A      + bucket_key_enabled     = (known after apply)%0A      + checksum_crc32         = (known after apply)%0A      + checksum_crc32c        = (known after apply)%0A      + checksum_sha1          = (known after apply)%0A      + checksum_sha256        = (known after apply)%0A      + content_type           = "text/html"%0A      + etag                   = (known after apply)%0A      + force_destroy          = false%0A      + id                     = (known after apply)%0A      + key                    = "/start/tutorials/mongodb/mongodb-pro-user-roles.html"%0A      + kms_key_id             = (known after apply)%0A      + server_side_encryption = (known after apply)%0A      + storage_class          = (known after apply)%0A      + tags_all               = (known after apply)%0A      + version_id             = (known after apply)%0A      + website_redirect       = "/start/tutorials/mongodb-pro/config-user-roles-mongodb-pro.html"%0A    }%0A%0APlan: 5 to add, 7 to change, 0 to destroy.%0A
::debug::stderr: 
::debug::exitcode: 0

```

</details>


*Pusher: @adrian-velonis1, Action: `pull_request`, Working Directory: `/home/runner/work/liquibase-docs/liquibase-docs`, Workflow: `Publish Redirects to Staging for Docs`*